[
  {
    "Name": "Chadding",
    "Image": "Chadding.png",
    "Tech Stack": "Typescript,React,Tailwind,NodeJs,Express,WebRTC,WebScokets,MySQL,Redis,Docker",
    "Title": "A Live Video Streaming Application",
    "Points": [
      "Chadding uses WebRTC and WebSockets for real-time video streaming and group video conferencing.",
      "It uses Selective Forwarding Unit (SFU) Architecture for handling the streams.",
      "Chadding is a Progressive Web App (PWA) which can be downloaded in Mobile.",
      "It can handle multiple user concurrently with minimal resources.",
      "It uses 800MB of memory for 1 streamer and 20 viewers at once."
    ],
    "link": "https://www.github.com/Rajeshpatel07/Chadding"
  },
  {
    "Name":"Cloudshell",
    "Image":"cloudshell.png",
    "Tech Stack":"Typescript, ReactJs, TailwindCSS, Shadcn, NodeJs, Postgres, Docker.",
    "Points":[
      "Developed a platform for users to create and manage virtual machines using various operating systems with a 50% faster deployment rate.",
      "Leveraged Docker to efficiently manage virtual machines, ensuring scalability and resource efficiency with a 30% reduction in memory usage.",
      " Integrated an interactive terminal for command execution in real-time, handling 50+ concurrent sessions."
    ],
    "link":"https://github.com/Rajeshpatel07/cloudshell"
  },
  {
    "Name": "Typeground",
    "Image": "typeground.png",
    "Tech Stack": "Typescript, ReactJs, Tailwind CSS, Websocket, NodeJs, MongoDB ",
    "Title": "Multiplayer Typing Game",
    "Points": [
      "It is a platform where people who want to learn how to type can gather and compete with each other and learn in the process.",
      "It has multiplayer matches with real-time palyers for testing how fast can you type",
      "It has Custom rooms as well where we can create room and play with friends"
    ],
    "link": "https://devpost.com/software/typeground"
  },

  {
    "Name": "mcShort",
    "Image": "URL_Shortner.png",
    "Tech Stack": "Javascript, ReactJs, Tailwind CSS, NodeJs, MongoDB",
    "Title": "A application which shorten the large url's",
    "Points": [
      "This web app generates short, unique URL's for easy sharing, helpling URL management for users.",
      "It uses MongoDB to store the original URL and create a short link which user can use.",
      "If user request for same URL it give the existing short link without creating new one."
    ],
    "link": "https://devpost.com/software/mcshort"
  }
]
